Repository: akoskissak/Booking-App-SIMS
Catalog: Properties/Resources.*.resx
Languages: sr_latn

source: About
sr_latn: O nama

# AboutApp
source: About the app
sr_latn: O aplikaciji

# AboutDiscoverText
source: Discover a wide range of accommodations tailored to your preferences and budget, and book with confidence. Our user-friendly interface makes finding the perfect place easy.
sr_latn: Otkrijte širok spektar smeštaja i tura prilagođen Vašim željama i budžetu, a zatim rezervišite sa sigurnošću. Naš user-friendly interfejs čini pronalazak savršenog smeštaja jednostavnim.

# AboutOurTeam
source: Our team of developers comprises talented students who are passionate about creating innovative solutions. With a blend of academic knowledge and practical skills, they bring fresh perspectives to our project. Each developer is motivated, enthusiastic, and committed to delivering high-quality results. Together, they collaborate seamlessly, leveraging their diverse experiences to drive innovation and success.
sr_latn: Našem timu developera pripadaju talentovani studenti koji gaje strast prema kreiranju inovativnih rešenja. Sa kombinacijom akademskog znanja i praktičnih veština, donose svežu perspektivu našem projektu. Svaki developer je motivisan, entuzijastičan i posvećen donošenju rezultata visokog kvaliteta. Zajedno, sarađuju bez problema i uravnotežavaju njihova različita iskustva radi postizanja inovacije i uspeha.

# AboutWelcomeText
source: Welcome to our booking app, where simplicity meets satisfaction. We've simplified the reservation process, ensuring your journey from browsing to booking is effortless.
sr_latn: Dobrodošli na našu aplikaciju za rezervisanje, gde se jednostavnost spaja sa satisfakcijom. Pojednostavili smo proces rezervisanja i osigurali da Vaš put od pretrage smeštaja i tura do rezervisanja istih bude lak.

source: Accommodation
sr_latn: Smeštaj

source: Accommodations
sr_latn: Smeštaji

source: Add picture
sr_latn: Dodaj sliku

# Adventure
source: Your adventure begins here.
sr_latn: Vaša avantura počinje ovde.

# AfterClosing
source: After you close it, it won't be possible to post new comments.
sr_latn: Nakon što ga zatvorite, neće biti moguće ostaviti nove komentare.

source: All forums
sr_latn: Svi forumi

# AllForumsDesc
source: All forums are shown on this page.
sr_latn: Svi forumi su prikazani na ovoj strani.

source: All requests
sr_latn: Svi zahtevi

source: Anywhere / Anytime
sr_latn: Bilo gde / Bilo kada

# AnywhereAnytimeDesc
source: If you wish to see all available accommodations according to your requests, choose below option:
sr_latn: Ako želite da vidite sve slobodne smeštaje na osnovu Vaših zahteva, izaberite opciju ispod:

source: Approved
sr_latn: Prihvaćeni

source: Back
sr_latn: Nazad

source: Bonus points:
sr_latn: Bonus poeni:

source: Cancel
sr_latn: Otkaži

# CancelHelp
source: If you want to cancel a reservation, you can do it by going to the Profile page. Cancel or delay a reservation in your list, by clicking on the corresponding buttons.
sr_latn: Ako želite da otkažete rezervaciju, možete to uraditi tako što ćete otići na stranicu Profil. Otkažite ili pomerite Vašu rezervaciju u listi, tako što ćete kliknuti na odgovarajuće dugmiće.

# CancelHint
source: Reservation cancellation is possible no later than 24 hours before the start date, unless the host specified the limit differently. If it exists, the limit can be seen in accommodation details.
sr_latn: Otkazivanje rezervacije je moguće najkasnije 24 sata pre početka, osim ako vlasnik nije definisao tu granicu drugačije. Ako postoji, granica se može videti u detaljima o smeštaju.

# CancelledRes
source: Cancelled reservations report
sr_latn: Izveštaj o otkazanim rezervacijama

source: Cancel reservation
sr_latn: Otkaži rezervaciju

# CancelSuccess
source: Your reservation is cancelled.
sr_latn: Vaša rezervacija je uspešno otkazana.

# CancelSure
source: Are you sure you want to cancel this reservation?
sr_latn: Da li ste sigurni da želite da otkažete ovu rezervaciju?

# ChooseHint
source: Please select one of the accommodations above. You can only rate accommodation and host five days at most after the end of the reservation.
sr_latn: Molimo Vas izaberite jedan od smeštaja iznad. Možete oceniti smeštaj i vlasnika najviše pet dana nakon što je rezervacija završena.

source: City
sr_latn: Grad

source: Cleanliness
sr_latn: Čistoća

# CleanlinessValid
source: Cleanliness field can't be empty.
sr_latn: Polje za čistoću ne može biti prazno.

# ClosedForum
source: This forum is closed. It is not possible to leave new comments.
sr_latn: Ovaj forum je zatvoren. Nije moguće ostaviti nove komentare.

# ClosedMessage
source: This forum is closed. It is not possible to leave new comments.
sr_latn: Ovaj forum je zatvoren. Nije moguće ostaviti nove komentare.

source: Close forum
sr_latn: Zatvori forum

# CloseSuccess
source: Your forum is closed.
sr_latn: Vaš forum je uspešno zatvoren.

# CloseSure
source: Are you sure you want to close this forum?
sr_latn: Da li ste sigurni da želite da zatvorite ovaj forum?

source: Comment
sr_latn: Komentar

# CommentValid
source: Comment field can't be empty.
sr_latn: Polje za komentar ne može biti prazno.

# ConfirmPass
source: Confirm new password
sr_latn: Potvrda nove lozinke

source: Continue
sr_latn: Nastavi

source: Correctness
sr_latn: Korektnost

# CorrectnessValid
source: Correctness field can't be empty.
sr_latn: Polje za korektnost ne može biti prazno.

source: Country
sr_latn: Drzava

# CreatedRes
source: Created reservations report
sr_latn: Izveštaj o napravljenim rezervacijama

source: Create forum
sr_latn: Napravi forum

# CreateForumSuccess
source: Forum is successfully created.
sr_latn: Forum je uspešno napravljen.

source: Create report
sr_latn: Generiši izveštaj

source: Date
sr_latn: Datum

# DateRangeValid
source: You need to select
sr_latn: Potrebno je izabrati

# DatesProblem
source: Problem with choosing dates
sr_latn: Problem sa biranjem dana.

# DayNum
source: Number of days
sr_latn: Broj dana:

# DayNumber
source: Number of days
sr_latn: Broj dana

# DayNumHint
source: It is neccessary to choose the same number of days you previously reserved.
sr_latn: Potrebno je izabrati isti broj dana koji ste uneli na prethodnoj strani.

source: days
sr_latn: dana.

source: Delay
sr_latn: Pomeri

source: Delay request
sr_latn: Zahtev za pomeranje

# DelaySuccess
source: Reservation delay request is successfully sent.
sr_latn: Zahtev za pomeranje rezervacije je uspešno poslat.

source: Details
sr_latn: Detalji

source: Developers
sr_latn: Developeri

source: End date
sr_latn: Krajnji datum

# EnterAt
source: Enter at least
sr_latn: Unesite bar

# FindPerfect
source: Find your perfect accommodation and reserve it with ease, whether you're planning a vacation, a business trip, or a spontaneous getaway. We make booking accommodations simple, so you can focus on making memories.
sr_latn: Pronađite Vaš savršen smeštaj i rezervišite ga sa lakoćom, bilo da planirate odmor, poslovno putovanje ili spontan odlazak. Omogućili smo da rezervisanje smeštaja bude lako, tako da možete da se fokusirate na stvaranje uspomena.

# ForumHelp
source: You can create a forum by going to the Profile page on Menu bar and choosing Forums tab from the side menu. There, you can see your previously created forums. To create a new forum, click on the corresponding button on the bootom of the page. It is also possible to close forum in which case no one will be able to post new comments.
sr_latn: Možete napraviti forum tako što ćete otići na stranicu Profile na Meniju i izabrati tab Forumi na sajd-baru. Tamo možete videti Vaše prethodno napravljene forume. Da biste napravili novi forum, kliknite na odgovarajuće dugme na dnu strane. Takođe, moguće je i zatvoriti forum. U tom slučaju neće biti moguće ostaviti nove komentare.

source: Forums
sr_latn: Forumi

source: Give up
sr_latn: Odustani

# GuestNumber
source: Number of guests
sr_latn: Broj gostiju

# GuestNumValid
source: Max. guest number is
sr_latn: Max. broj gostiju je

# GuestStatus
source: Status: guest
sr_latn: Status: gost

# HasRated
source: has rated you:
sr_latn: vas je ocenio/la:

source: Help
sr_latn: Pomoć

source: Home
sr_latn: Početna

source: Home page
sr_latn: Početna strana

source: Host
sr_latn: Vlasnik

# HostComment
source: Comment by host
sr_latn: Komentar vlasnika

# HowCancel
source: How to cancel or delay reservation?
sr_latn: Kako otkazati ili pomeriti rezervaciju?

# HowForum
source: How to create a forum?
sr_latn: Kako napraviti forum?

# HowRate
source: How to rate accommodation and host?
sr_latn: Kako oceniti smeštaj i vlasnika?

# HowReservation
source: How to create reservation?
sr_latn: Kako napraviti rezervaciju?

# HowSuperGuest
source: How to become a Super-guest?
sr_latn: Kako postati Super-gost?

# InputHint
source: Enter values in corresponding fields. It is neccessary to reserve at least the number of days specified in accommodation description.
sr_latn: Unesite vrednosti u odgovarajuća polja. Potrebno je da rezervišete najmanje onoliko dana koliko je navedeno u opisu smeštaja.

# InputProblem
source: Problem with data input
sr_latn: Problem sa unosom podataka

# Language
source: English
sr_latn: Srpski

# Level
source: Urgency level
sr_latn: Nivo hitnosti

# Level1
source: Level 1 - It would be nice to renovate some small things, but everything works fine without it.
sr_latn: Nivo 1 - bilo bi lepo renovirati neke sitnice, ali sve funkcioniše kako treba i bez toga

# Level2
source: Level 2 - There are minor complaints about the accommodation which, if addressed, would make it perfect.
sr_latn: Nivo 2 - male zamerke na smeštaj koje kada bi se uklonile bi ga učinile savršenim"

# Level3
source: Level 3 - Several things that really bothered me should be renovated.
sr_latn: Nivo 3 - nekoliko stvari koje su baš zasmetale bi trebalo renovirati

# Level4
source: Level 4 - There are many bad things and renovation is really necessary.
sr_latn: Nivo 4 - ima dosta loših stvari i renoviranje je stvarno neophodno

# Level5
source: Level 5 - The accommodation is in very bad condition and it's not worth renting it at all unless it's renovated.
sr_latn: Nivo 5 - smeštaj je u jako lošem stanju i ne vredi ga uopšte iznajmljivati ukoliko se ne renovira

# LocatedReport
source: The report is now located on your computer.
sr_latn: Izveštaj se nalazi na Vašem kompjuteru.

source: Location
sr_latn: Lokacija

# LocationDetails
source: nista
sr_latn: {}Location: {0}&#x0a;Max. number of guests: {1}&#x0a;Min. number of reservation days: {2}&#x0a;Rate: {3}

# LoggedIn
source: You are logged in as a guest.
sr_latn: Ulogovani ste kao gost.

# MaxGuestNumber
source: Max. number of guests
sr_latn: Max. broj gostiju

# MinDayNumber
source: Min. number of days
sr_latn: Min. broj dana

# MoreDetailed
source: More detailed explanations are available as hints for each functionality.
sr_latn: Detaljnija objašnjenja su dostupna u vidu hintova za svaku funkcionalnost.

source: Name
sr_latn: Naziv

source: New dates:
sr_latn: Novi datumi:

# NewPass
source: New password
sr_latn: Nova lozinka

# NewUser
source: New username
sr_latn: Novo korisničko ime

# OldPass
source: Old password
sr_latn: Stara lozinka

source: Optional
sr_latn: Opciono

# OptionalMsg
source: Optional: You can leave your accommodation pictures and reccommend renovation.
sr_latn: Opciono: Možete ostaviti Vaše slike smeštaja ili napraviti preporuku za renovaciju.

source: Password
sr_latn: Lozinka

# PasswordChange
source: Change password
sr_latn: Promeni lozinku

source: Path
sr_latn: Putanja

source: Pending
sr_latn: Na čekanju

# PeopleNum
source: Number of people:
sr_latn: Broj ljudi:

# PleaseChooseDays
source: Please choose days and number od people for your reservation.
sr_latn: Molimo Vas izaberite dane i broj ljudi za Vašu rezervaciju.

# PleaseChooseDelay
source: Please choose new dates for your reservation, and then wait for host's response. Requests can be pending, approved or rejected.
sr_latn: Molimo Vas izaberite nove datume za Vašu rezervaciju i zatim sačekajte vlasnikov odgovor. Zahtev može biti na čekanju, prihvaćen ili odbijen.

source: Post comment
sr_latn: Ostavi komentar

source: Previous dates:
sr_latn: Prethodni datumi:

# ProblemCancel
source: Problem with reservation cancellation
sr_latn: Problem sa otkazivanjem rezervacije

source: Profile
sr_latn: Profil

source: Profile settings
sr_latn: Podešavanje profila

source: Rate
sr_latn: Ocena

source: Rate accommodation
sr_latn: Oceni smeštaj

# RateButton
source: Rate
sr_latn: Oceni

# RateHelp
source: You can rate accommodation and host by going to the Profile page on Menu bar, and choosing Rate accommodation tab from side menu. Next step is to pick a reservation from provided reservations. You can only rate accommodation within five days after the reservation is finished.
sr_latn: Možete oceniti smeštaj i gosta tako što ćete otići na Profilnu sranu na Meniju i izabrati Oceni smeštaj na sajd-baru. Sledeći korak je da izaberete rezervaciju iz ponuđenih rezervacija. Možete oceniti smeštaj najkasnije 5 dana nakon što je rezervacija završena.

# RateHint
source: Please enter rates for cleanliness and correctness. To recommend a renovation, you need to enter all mandatory values and then click on the "Recommend renovation" button."
sr_latn: Molimo Vas unesite ocene za čistoću i korektnost. Da biste napravili preporuku za renovaciju, potrebno je da prvo unesete sva obavezna polja i zatim kliknete na dugme Preporuka za renoviranje.

# RateProblem
source: Problem with accommodation rating
sr_latn: Problem sa ocenjivanjem smeštaja

source: Rates by host
sr_latn: Ocene vlasnika

# RatesByHostDesc
source: On this page, you can see how you were rated by the hosts.
sr_latn: Na ovoj stranici možete videti kako su Vas ocenili vlasnici.

# RateSuccess
source: The accommodation is successfully rated.
sr_latn: Smeštaj je uspešno ocenjen.

# Rating
source: Ratng:
sr_latn: Ocena:

# Recommend
source: Recommend renovation
sr_latn: Preporuka za renoviranje

source: Recommendation
sr_latn: Preporuka

# RecommendDesc
source: It is necessary to fill in information about what should be renovated. After that, choose the level of urgency.
sr_latn: Potrebno je da navedete informacije o tome šta treba da bude renovirano. Nakon toga, izaberite nivo hitnosti.

source: Rejected
sr_latn: Odbijeni

# ReportsDesc
source: This page is for creating reports about reservations in a specific time period. Please choose report type and time period.
sr_latn: Ova stranica je za kreiranje izveštaja o rezervacijama u određenom vremenskom periodu. Molimo Vas izaberite tip i vremenski period.

# ReportSuccess
source: Report is successfully created.
sr_latn: Izveštaj je uspešno kreiran.

source: Report type
sr_latn: Tip izveštaja

source: Request details
sr_latn: Detalji o zahtevu

source: Requests
sr_latn: Zahtevi

# Required
source: Please enter required information.
sr_latn: Molimo Vas unesite tražene podatke.

source: Reservation
sr_latn: Rezervacija

source: Reservation details
sr_latn: Detalji o rezervaciji

# ReservationHelp
source: You can create a reservation by going to the Accommodations page on the Menu bar, or clicking on Reserve button on Home page. There you can pick an accommodation from the list and click on Reserve. The other option is Anywhere / Anytime reservation which will give you all available accommodations according to your needs.
sr_latn: Možete kreirati rezervaciju tako što ćete otići na stranicu Smeštaji na Meniju, ili kliknuti na Rezerviši dugme na početnoj strani. Tamo možete izabrati smeštaj iz liste i kliknuti na dugme Rezerviši. Druga opcija je rezervacija "Bilo gde / Bilo kada" koja će vam pružiti sve slobodne smeštaje na osnovu Vaših potreba.

source: Reservation report
sr_latn: Izveštaj o rezervacijama

source: Reservations
sr_latn: Rezervacije

# ReservationSuccess
source: Reservation is successfully created.
sr_latn: Rezervacija je uspešno napravljena.

source: Reserve
sr_latn: Rezerviši

# ResPastYear
source: Reservation number in the past year:
sr_latn: Rezervacije u proteklih godinu dana:

# ReviewProblem
source: Problem with creating a review
sr_latn: Problem sa ocenjivanjem smeštaja

# RquestsDesc
source: You can see all of your requests sorted by status on this page.
sr_latn: Možete da vidite sve Vaše zahteve sortirane po statusu na ovoj strani.

source: Rules-following
sr_latn: Poštovanje pravila

source: Save
sr_latn: Sačuvaj

source: Search
sr_latn: Pretraži

source: Search accommodations
sr_latn: Pretraga smeštaja

source: Search forums
sr_latn: Pretraga foruma

source: Select dates
sr_latn: Izaberi datume

source: Settings
sr_latn: Podešavanja

source: special
sr_latn: specijalno

source: Start date
sr_latn: Početni datum

# SuperGuestHelp
source: In order to become a Super-guest, you need to create at least 10 reservations in the past a year. With the Super-guest status, you also get 5 bonus points that bring you discounts when creating a reservation. Super-guest status lasts for a year and it can be prolonged if you created another 10 reservations in the past year.
sr_latn: Da biste postali Super-gost, potrebno je da ostvarite bar 10 rezervacija u proteklih godinu dana. Sa statusom Super-gosta dobijame 5 dodatnih poena koji Vam donose popuste pri pravljenju rezervacije. Status traje godinu dana i može biti produžen ukoliko ste u međuvremenu kreirali još 10 rezervacija u proteklih godinu dana.

# SuperGuestStatus
source: Status: super-guest
sr_latn: Status: super-gost

# TheSystemAA
source: The system will recommend you all available accommodations depending on your input.
sr_latn: Sistem će Vam preporučiti sve slobodne smeštaje na osnovu Vašeg unosa.

source: Time period
sr_latn: Vremenski period

# TotalRes
source: Total reservation number:
sr_latn: Ukupan broj rezervacija:

source: Type
sr_latn: Tip

source: , until
sr_latn: , do

# UsernameChange
source: Change username
sr_latn: Promeni korisničko ime

source: very useful
sr_latn: veoma korisno

source: View forum
sr_latn: Vidi forum

# WelcomeAA
source: Welcome to the "anywhere/anytime" reservation page. Please, enter number of guests and days by choice. Optionally, you can choose date range.
sr_latn: Dobrodošli na "Bilo gde / Bilo kada" stranicu za rezervaciju. Molimo Vas, unesite broj gostiju i dana po izboru. Opciono, možete izabrati raspon datuma.

# WelcomeHome
source: Welcome
sr_latn: Dobrodošli

# WelcomeRating
source: Welcome to the accommodation rating page. To create a review, fill the cleanliness and correctness rate fields, as well as the comment field.
sr_latn: Dobrodošli na stranicu za ocenjivanje smeštaja. Da biste napravili zahtev, popunite polja za čistoću i korektnost, kao i komentar.

# WelcomeRes
source: Welcome to the reservation page.
sr_latn: Dobrodošli na stranicu za rezervaciju.

# YouCanChoose
source: You can choose one of the recommended accommodations.
sr_latn: Možete izabrati jedan od preporučenih smeštaja.

source: Your forums
sr_latn: Vaši forumi

source: Your profile
sr_latn: Vaš profil
